import matplotlib.pyplot as plt
import sys

if len(sys.argv) != 2:
	print("Usage: python3 pixelAnalyzer.py \"<ints separated by commas>\"")
	sys.exit(0)

s = list(map(int, (sys.argv[1].split(','))))
s = [None, *s]
#s = [None, 3881, 3881, 3881, 4029, 4085, 4119, 4155, 1626, 1504, 1480, 1480, 1480, 1480, 1480, 1480, 1480, 1480, 1480, 1556, 1556, 1556, 3640, 3648, 3552, 3552, 3552, 3552, 3552, 1631, 1631, 1619, 1619, 1619, 1619, 1615, 4162, 4162, 4162, 5625, 5625, 5625, 5625, 5507, 5539, 5539, 5539, 5539, 5539, 5539, 0, 0, 0, 0, 0, 0, 32, 0, 0, 160, 160, 208, 208, 260, 4707, 4983, 4951, 5181, 5181, 5181, 5181, 5181, 5065, 5197, 5189, 5157, 4969, 5113, 684, 640, 656, 528, 616, 428, 376, 5041, 4893, 4803, 4933, 4933, 4957, 4827, 512, 448, 388, 460, 0, 0, 0, 5625, 5625, 5625, 5625, 5625, 5625, 5625, 0, 0, 0, 0, 0, 0, 0, 5625, 5625, 5625, 5625, 5625, 5625]
add_grid = []

for i in range(0, int((len(s) / 14) + 1)):
    add_grid.append(i * 14)
for i in add_grid:
    plt.plot([ i, i ] , [-100, 10000], color="red")
    plt.plot([ i - 6.5, i - 6.5 ], [0, 9800], color="green")
plt.xlabel("кадры")
plt.ylabel("маркированные пиксели")
plt.plot(s)
plt.show()


